Revit 2027 API
NumberingFormattedParameter Methods
The NumberingFormattedParameter type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParameter |  Get the target parameter for formatting.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetParameter |  Set the target parameter for formatting.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
NumberingFormattedParameter Class
Autodesk.Revit.DB Namespace